In [4]:
import pandas as pd
import os

In [2]:
import pandas as pd
import os
df_list = []
dirname = './data_100k_cars'
for dirname, _, filenames in os.walk(dirname):
    for filename in filenames:
        if not (filename.startswith("unclean") or filename==".DS_Store"):
            print(f"Processing: {filename}")
            df_tmp = pd.read_csv(os.path.join(dirname, filename)).drop_duplicates()
            df_tmp['car_model'] = filename.split(".")[0]
            df_list.append(df_tmp)
car_data = pd.concat(df_list, axis=0)
print(car_data.shape)
car_data.sample(15).T


car_data.head()

Processing: toyota.xls
Processing: skoda.xls
Processing: merc.xls
Processing: ford.xls
Processing: vw.xls
Processing: bmw.xls
Processing: vauxhall.xls
Processing: hyundi.xls
Processing: audi.xls
(97712, 11)

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize,car_model,tax(£)
0,GT86,2016,16000,Manual,24089,Petrol,265.0,36.2,2.0,toyota,NaN
1,GT86,2017,15995,Manual,18615,Petrol,145.0,36.2,2.0,toyota,NaN
2,GT86,2015,13998,Manual,27469,Petrol,265.0,36.2,2.0,toyota,NaN
3,GT86,2017,18998,Manual,14736,Petrol,150.0,36.2,2.0,toyota,NaN
4,GT86,2017,17498,Manual,36284,Petrol,145.0,36.2,2.0,toyota,NaN

In [ ]:
import sqlite3
conn = sqlite3.connect("car_data.db")

cur = conn.cursor()


car_data.to_sql("car_data_tbl", conn, if_exists="replace")

pd.read_sql_query("select * from car_data_tbl;", conn)

cur.close()
conn.close()

In [11]:
import sqlite3
conn = sqlite3.connect("car_data.db")

list_of_models = pd.read_sql_query('Select Distinct model from car_data_tbl', conn)
list_of_models

list_of_models.to_csv('./data_100k_cars/list_of_models.csv')

       model
0       GT86
1    Corolla
2       RAV4
3      Yaris
4      Auris
..       ...
190      SQ7
191       S3
192       S5
193       A2
194      RS7

[195 rows x 1 columns]